

SIMULATION_EVENTS = [
    "add_hardcover",
    "add_softcover",
    "add_glossycover",
    "borrow_book",
    "return_book",
    "damage_book",
    "search_by_cover_type",
    "check_condition",
    "remove_book",
    "get_nonexistent_book",
    "search_by_author",
    "search_by_genre", 
    "search_by_year"
]

class CoverType:
    HARD = 'твёрдая'
    SOFT = 'мягкая'
    GLOSSY = 'глянцевая'


GENRES = [
    "Роман",
    "Антиутопия",
    "Фантастика",
    "Детектив",
    "Поэзия",
    "Классика",
    "Приключения",
    "Драмма"
]

TITLES = [
    "Эхо забытых созвездий",
    "Дневник последнего алхимика",
    "Город, которого нет на картах",
    "Инструкция по сборке реальности",
    "Кофе с призраком соседа",
    "Код города",
    "Теория хрупких совпадений",
    "Кулинарная книга забытых вкусов",
    "Атлас невидимых городов",
    "Правила общения с морскими богами",
    "Физика на пальцах",
    "Горизонты нейронауки",
    "Химия эмоций",
    "Как научиться молчать",
    "Почему дети так делают",
    "О чём молчат родители",
    "Почему вас не замечают",
    "Между двух ветров",
    "Голос из прошлого",
    "Дневник незнакомки", 
    "Последний свет маяка",
    "Записки провинциального врача"
]

AUTHORS = [
    "Хироси Танака",
    "Мария дель Мар Родригес",
    "Амарджид Синг",
    "Лукас Петерсен",
    "Ана Мария Дуарте",
    "Чжан Ли",
    "Михаил Богданов",
    "Айгерим Нурпеисова",
    "Джульетта Бартоломеи",
    "Ли Мин Хо",
    "Сара Бен",
    "Карлос Мендоса",
    "Ричард Касл",
    "Редакция журнала"
]